job_list = {
    '귀검사(남)': [
        '검신',
        '다크로드',
        '블러드이블',
        '인다라천',
        '악귀나찰'
    ],
    '귀검사(여)': [
        '마제스티',
        '디어사이드',
        '네메시스',
        '검제'
    ],
    '격투가(남)': [
        '염황광풍제월',
        '패황',
        '명왕',
        '그랜드마스터'
    ],
    '격투가(여)': [
        '염제폐월수화',
        '카이저',
        '용독문주',
        '얼티밋디바'
    ],
    '거너(남)': [
        '레이븐',
        '디스트로이어',
        '프라임',
        '커맨더'
    ],
    '거너(여)': [
        '크림슨로제',
        '스톰트루퍼',
        '옵티머스',
        '프레이야'
    ],
    '마법사(남)': [
        '오블리비언',
        '이터널',
        '뱀파이어로드',
        '아이올로스',
        '어센션'
    ],
    '마법사(여)': [
        '오버마인드',
        '이클립스',
        '아슈타르테',
        '지니위즈',
        '(버프)헤카테'
    ],
    '프리스트(남)': [
        '세인트',
        '(버프)세인트',
        '저스티스',
        '태을선인',
        '이모탈'
    ],
    '프리스트(여)': [
        '(버프)세라핌',
        '인페르노',
        '천선낭랑',
        '리디머'
    ],
    '도적': [
        '알키오네',
        '타나토스',
        '시라누이',
        '그림리퍼'
    ],
    '나이트': [
        '가이아',
        '마신',
        '세이비어',
        '드레드노트'
    ],
    '마창사': [
        '듀란달',
        '워로드',
        '제노사이더',
        '에레보스'
    ],
    '총검사': [
        '갓파더',
        '레퀴엠',
        '언터처블',
        '패스파인더'
    ],
    '외전': [
        '다크나이트',
        '크리에이터'
    ],
    '버퍼': [
        '(버프)세인트',
        '(버프)세라핌',
        '(버프)헤카테',
    ]
}
