job_list = {
    '鬼剣士(男)': [
        '剣神',
        'ダークロード',
        'ブラッドイーブル',
        '因陀羅天',
        '悪鬼羅刹'
    ],
    '鬼剣士(女)': [
        'マジェスティ',
        'ディーサイド',
        'ネメシス',
        '剣帝',
        'ヴェンデッタ'
    ],
    '格闘家(男)': [
        '念皇光風霽月',
        '覇皇',
        '冥王',
        'グランドマスター'
    ],
    '格闘家(女)': [
        '念帝閉月羞花',
        'カイザー',
        '用毒門主',
        'アルティメットディーバ'
    ],
    'ガンナー(男)': [
        'レイヴン',
        'デストロイヤー',
        'プライム',
        'コマンダー'
    ],
    'ガンナー(女)': [
        'クリムゾンローゼ',
        'ストームルーパー',
        'オプティマス',
        'フレイヤ'
    ],
    'メイジ(男)': [
        'オブリビオン',
        'エターナル',
        'ヴァンパイアロード',
        'アイオロス',
        'アセンション'
    ],
    'メイジ(女)': [
        'オーバーマインド',
        'エクリプス',
        'アシュタルテ',
        'ジーニーウィズ',
        '(バフ)ヘカテー'
    ],
    'プリースト(男)': [
        'セイント',
        '(バフ)セイント',
        'ジャスティス',
        '太乙仙人',
        'イモータル'
    ],
    '프리스트(여)': [
        '(バフ)セラフィム',
        'インフェルノ',
        '天仙娘々',
        'リディーマー'
    ],
    'シーフ': [
        'アルシオーネ',
        'タナトス',
        '不知火',
        'グリムリーパー'
    ],
    'ナイト': [
        'ガイア',
        '魔神',
        'セイヴァー',
        'ドレッドノート'
    ],
    '魔槍士': [
        'デュランダル',
        'ウォーロード',
        'ジェノサイダー',
        'エレボス'
    ],
    'ガンブレーダー': [
        'ゴッドファーザー',
        'ラメント',
        'アンタッチャブル',
        'パスファインダー'
    ],
    '外伝': [
        'ダークナイト',
        'クリエーター'
    ],
    'バフ': [
        '(バフ)セイント',
        '(バフ)セラフィム',
        '(バフ)ヘカテー',
    ]
}
