wep_list = {
    '귀검/나이트': {
        '광검': [
            '별의 바다 : 바드나후',
            '적광검 루이너스',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '소검': [
            '전장의 열정 : 앵거바딜',
            '신념의 징표 : 칼리번',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '둔기': [
            '판데모니엄 플레임',
            '하티 - 달을 탐하는 자',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '도': [
            '태극천제검(음)',
            '태극천제검(양)',
            '아방가르드',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '대검': [
            '데우스 이미저리',
            '카심의 대검',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ]
    },
    '격투가': {
        '너클': [
            '백호의 울음소리',
            '청명한 의지',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '통파': [
            '청사곤',
            '어그레시브 카이트',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '클로': [
            '매드 싸이클론',
            '로드 오브 더 페인',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '건틀릿': [
            '태음신 : 영귀',
            '디스트로이 프레셔',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '권투글러브': [
            '블레이즈 헌터',
            '일렉트로 부스터',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ]
    },
    '거너': {
        '자동권총': [
            '팔로우 더 스타티스',
            '메가쇼크 런처',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '보우건': [
            '커스텀 라이져 보우',
            '음유시인의 만돌린',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '리볼버': [
            '미드나잇 러시안 룰렛',
            '블러드 샷 부스터',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '머스켓': [
            '터뷸런스',
            '스트라이커-X',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '핸드캐넌': [
            '레볼루션 차지',
            '오버스펙 라이즈',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ]
    },
    '마법사': {
        '스태프': [
            '세계수의 뿌리',
            '루나 베네딕티오',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '로드': [
            '플레임 헬',
            '마력의 샘 : 카스탈리아',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '봉': [
            '우디 부기',
            '카오스 시드',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '창': [
            '어나이얼레이터',
            '영창 : 불멸의 혼',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '빗자루': [
            '세계수의 요정',
            '순백의 기도',
            '검은 성전의 기억',
            '원초의 꿈(딜5개조/벞3개조)'
        ]
    },
    '프리스트': {
        '십자가': [
            '포 더 세크리드',
            '눈부신 영광',
            '검은 성전의 기억',
            '원초의 꿈(딜5개조/벞3개조)'
        ],
        '염주': [
            '윤회의 고리 : 환룡',
            '고대 신수의 기억',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '토템': [
            '라스트 인파이팅',
            '개척자의 길',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '배틀액스': [
            '불카누스의 두번째 흔적',
            '신념의 무게',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '낫': [
            '루즈 리즌',
            '이교도 교주의 심판',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ]
    },
    '도적': {
        '단검': [
            '샤프 쉐도어',
            '암살단장의 옥장도',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '쌍검': [
            '화려한 눈속임',
            '핏빛 무도회',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '완드': [
            '푸른 생명의 이면',
            '고결한 정령의 유물',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '차크라웨펀': [
            '블러드 루비아이',
            '도화선',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ]
    },
    '마창사': {
        '장창': [
            '끊임없는 환영',
            '전장의 선봉장',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '미늘창': [
            '통곡의 수문장',
            '사암주극',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '광창': [
            '일렉트로전',
            '천장군 : 전승의 빛',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '투창': [
            '사일런트 베놈',
            '기가 드릴러',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ]
    },
    '총검사': {
        '장도': [
            '금강비장도',
            '야천도',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '소태도': [
            '차갑게 굳어버린 홍염',
            '다크 플레임 리퍼',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '중검': [
            '아토믹 파일',
            '홍염폭검',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ],
        '코어블레이드': [
            '베투스 코르',
            '프로젝트 : 오버코어',
            '검은 성전의 기억',
            '원초의 꿈(5개조)'
        ]
    }
}

wep_image_filename = {
    "00150": "별의 바다 : 바드나후", "00161": "적광검 루이너스", "h12": "검은 성전의 기억", "00168": "원초의 꿈(5개조)",
    "00169": "전장의 열정 : 앵거바딜", "00182": "신념의 징표 : 칼리번", "h28": "검은 성전의 기억", "00190": "원초의 꿈(5개조)",
    "00162": "판데모니엄 플레임", "00177": "하티 - 달을 탐하는 자", "h22": "검은 성전의 기억", "00188": "원초의 꿈(5개조)",
    "00199": "태극천제검(음)", "001991": "태극천제검(양)", "00181": "아방가르드", "h36": "검은 성전의 기억", "00209": "원초의 꿈(5개조)",
    "00183": "데우스 이미저리", "00196": "카심의 대검", "h35": "검은 성전의 기억", "00210": "원초의 꿈(5개조)",
    "00186": "백호의 울음소리", "00175": "청명한 의지", "h31": "검은 성전의 기억", "00194": "원초의 꿈(5개조)",
    "00169(1)": "청사곤", "00159": "어그레시브 카이트", "h19": "검은 성전의 기억", "00179": "원초의 꿈(5개조)",
    "00166": "매드 싸이클론", "00178": "로드 오브 더 페인", "h25": "검은 성전의 기억", "00188(1)": "원초의 꿈(5개조)",
    "00174": "태음신 : 영귀", "00161(1)": "디스트로이 프레셔", "h24": "검은 성전의 기억", "00183(1)": "원초의 꿈(5개조)",
    "00157": "블레이즈 헌터", "00145": "일렉트로 부스터", "h10": "검은 성전의 기억", "00164": "원초의 꿈(5개조)",
    "00179(1)": "팔로우 더 스타티스", "00177(1)": "메가쇼크 런처", "h26": "검은 성전의 기억", "00187": "원초의 꿈(5개조)",
    "00165": "커스텀 라이져 보우", "00155": "음유시인의 만돌린", "h16": "검은 성전의 기억", "00175(1)": "원초의 꿈(5개조)",
    "00154": "미드나잇 러시안 룰렛", "00166(1)": "블러드 샷 부스터", "h14": "검은 성전의 기억", "00172": "원초의 꿈(5개조)",
    "00173": "터뷸런스", "00159(1)": "스트라이커-X", "h20": "검은 성전의 기억", "00182(1)": "원초의 꿈(5개조)",
    "00171": "레볼루션 차지", "00159(2)": "오버스펙 라이즈", "h18": "검은 성전의 기억", "178(1)": "원초의 꿈(5개조)",
    "00193": "세계수의 뿌리", "00177(2)": "루나 베네딕티오", "h33": "검은 성전의 기억", "00200": "원초의 꿈(5개조)",
    "00188(2)": "플레임 헬", "00175(3)": "마력의 샘 : 카스탈리아", "h29": "검은 성전의 기억", "00199(1)": "원초의 꿈(5개조)",
    "0017400174(1)": "우디 부기", "00176": "카오스 시드", "h23": "검은 성전의 기억", "00181(1)": "원초의 꿈(5개조)",
    "00187(1)": "어나이얼레이터", "00175(2)": "영창 : 불멸의 혼", "h30": "검은 성전의 기억", "00197": "원초의 꿈(5개조)",
    "00161(2)": "세계수의 요정", "00149": "순백의 기도", "h11": "검은 성전의 기억", "00168(1)": "원초의 꿈(딜5개조/벞3개조)",
    "00165(1)": "포 더 세크리드", "00154(1)": "눈부신 영광", "h15": "검은 성전의 기억", "00173(1)": "원초의 꿈(딜5개조/벞3개조)",
    "00162(1)": "윤회의 고리 : 환룡", "00164(1)": "고대 신수의 기억", "h9": "검은 성전의 기억", "00169(2)": "원초의 꿈(5개조)",
    "00182(2)": "라스트 인파이팅", "00167": "개척자의 길", "h27": "검은 성전의 기억", "00192": "원초의 꿈(5개조)",
    "00162(2)": "불카누스의 두번째 흔적", "00173(2)": "신념의 무게", "h21": "검은 성전의 기억", "00185": "원초의 꿈(5개조)",
    "00157(1)": "루즈 리즌", "00168(2)": "이교도 교주의 심판", "h17": "검은 성전의 기억", "00175(4)": "원초의 꿈(5개조)",
    "00180": "샤프 쉐도어", "00191": "암살단장의 옥장도", "h34": "검은 성전의 기억", "00198": "원초의 꿈(5개조)",
    "00191(1)": "화려한 눈속임", "00189": "핏빛 무도회", "h32": "검은 성전의 기억", "00199(2)": "원초의 꿈(5개조)",
    "00212": "푸른 생명의 이면", "00210(1)": "고결한 정령의 유물", "h37": "검은 성전의 기억", "00219": "원초의 꿈(5개조)",
    "00150(1)": "블러드 루비아이", "00148": "도화선", "h8": "검은 성전의 기억", "00155(1)": "원초의 꿈(5개조)",
    "00163": "끊임없는 환영", "00150(2)": "전장의 선봉장", "h13": "검은 성전의 기억", "00171(1)": "원초의 꿈(5개조)",
    "00146": "통곡의 수문장", "00132": "사암주극", "h7": "검은 성전의 기억", "00157(2)": "원초의 꿈(5개조)",
    "00138": "일렉트로전", "00129": "천장군 : 전승의 빛", "h5": "검은 성전의 기억", "00146(1)": "원초의 꿈(5개조)",
    "00129(1)": "사일런트 베놈", "00138(1)": "기가 드릴러", "h4": "검은 성전의 기억", "00145(1)": "원초의 꿈(5개조)",
    "00141": "금강비장도", "00128": "야천도", "h6": "검은 성전의 기억", "00150(3)": "원초의 꿈(5개조)",
    "00134": "차갑게 굳어버린 홍염", "00124": "다크 플레임 리퍼", "h2": "검은 성전의 기억", "00142": "원초의 꿈(5개조)",
    "00121": "아토믹 파일", "00136": "홍염폭검", "h3": "검은 성전의 기억", "00146(2)": "원초의 꿈(5개조)",
    "00119": "베투스 코르", "00128(1)": "프로젝트 : 오버코어", "h1": "검은 성전의 기억", "00135": "원초의 꿈(5개조)"
}

wep_filename_image = {'별의 바다 : 바드나후': '00150', '적광검 루이너스': '00161', '검은 성전의 기억': 'h12',
                      '원초의 꿈(5개조)': '00168', '전장의 열정 : 앵거바딜': '00169', '신념의 징표 : 칼리번': '00182',
                      '검은 성전의 기억': 'h28', '원초의 꿈(5개조)': '00190', '판데모니엄 플레임': '00162',
                      '하티 - 달을 탐하는 자': '00177', '검은 성전의 기억': 'h22', '원초의 꿈(5개조)': '00188',
                      '태극천제검(음)': '00199', '태극천제검(양)': '001991', '아방가르드': '00181', '검은 성전의 기억': 'h36',
                      '원초의 꿈(5개조)': '00209', '데우스 이미저리': '00183', '카심의 대검': '00196', '검은 성전의 기억': 'h35',
                      '원초의 꿈(5개조)': '00210', '백호의 울음소리': '00186', '청명한 의지': '00175',
                      '검은 성전의 기억': 'h31', '원초의 꿈(5개조)': '00194', '청사곤': '00169(1)',
                      '어그레시브 카이트': '00159', '검은 성전의 기억': 'h19', '원초의 꿈(5개조)': '00179',
                      '매드 싸이클론': '00166', '로드 오브 더 페인': '00178', '검은 성전의 기억': 'h25',
                      '원초의 꿈(5개조)': '00188(1)', '태음신 : 영귀': '00174', '디스트로이 프레셔': '00161(1)',
                      '검은 성전의 기억': 'h24', '원초의 꿈(5개조)': '00183(1)', '블레이즈 헌터': '00157',
                      '일렉트로 부스터': '00145', '검은 성전의 기억': 'h10', '원초의 꿈(5개조)': '00164',
                      '팔로우 더 스타티스': '00179(1)', '메가쇼크 런처': '00177(1)', '검은 성전의 기억': 'h26',
                      '원초의 꿈(5개조)': '00187', '커스텀 라이져 보우': '00165', '음유시인의 만돌린': '00155',
                      '검은 성전의 기억': 'h16', '원초의 꿈(5개조)': '00175(1)', '미드나잇 러시안 룰렛': '00154',
                      '블러드 샷 부스터': '00166(1)', '검은 성전의 기억': 'h14', '원초의 꿈(5개조)': '00172',
                      '터뷸런스': '00173', '스트라이커-X': '00159(1)', '검은 성전의 기억': 'h20',
                      '원초의 꿈(5개조)': '00182(1)', '레볼루션 차지': '00171', '오버스펙 라이즈': '00159(2)',
                      '검은 성전의 기억': 'h18', '원초의 꿈(5개조)': '178(1)', '세계수의 뿌리': '00193',
                      '루나 베네딕티오': '00177(2)', '검은 성전의 기억': 'h33', '원초의 꿈(5개조)': '00200',
                      '플레임 헬': '00188(2)', '마력의 샘 : 카스탈리아': '00175(3)', '검은 성전의 기억': 'h29',
                      '원초의 꿈(5개조)': '00199(1)', '우디 부기': '0017400174(1)', '카오스 시드': '00176',
                      '검은 성전의 기억': 'h23', '원초의 꿈(5개조)': '00181(1)', '어나이얼레이터': '00187(1)',
                      '영창 : 불멸의 혼': '00175(2)', '검은 성전의 기억': 'h30', '원초의 꿈(5개조)': '00197',
                      '세계수의 요정': '00161(2)', '순백의 기도': '00149', '검은 성전의 기억': 'h11',
                      '원초의 꿈(딜5개조/벞3개조)': '00168(1)', '포 더 세크리드': '00165(1)', '눈부신 영광': '00154(1)',
                      '검은 성전의 기억': 'h15', '원초의 꿈(딜5개조/벞3개조)': '00173(1)', '윤회의 고리 : 환룡': '00162(1)',
                      '고대 신수의 기억': '00164(1)', '검은 성전의 기억': 'h9', '원초의 꿈(5개조)': '00169(2)',
                      '라스트 인파이팅': '00182(2)', '개척자의 길': '00167', '검은 성전의 기억': 'h27',
                      '원초의 꿈(5개조)': '00192', '불카누스의 두번째 흔적': '00162(2)', '신념의 무게': '00173(2)',
                      '검은 성전의 기억': 'h21', '원초의 꿈(5개조)': '00185', '루즈 리즌': '00157(1)',
                      '이교도 교주의 심판': '00168(2)', '검은 성전의 기억': 'h17', '원초의 꿈(5개조)': '00175(4)',
                      '샤프 쉐도어': '00180', '암살단장의 옥장도': '00191', '검은 성전의 기억': 'h34',
                      '원초의 꿈(5개조)': '00198', '화려한 눈속임': '00191(1)', '핏빛 무도회': '00189',
                      '검은 성전의 기억': 'h32', '원초의 꿈(5개조)': '00199(2)', '푸른 생명의 이면': '00212',
                      '고결한 정령의 유물': '00210(1)', '검은 성전의 기억': 'h37', '원초의 꿈(5개조)': '00219',
                      '블러드 루비아이': '00150(1)', '도화선': '00148', '검은 성전의 기억': 'h8',
                      '원초의 꿈(5개조)': '00155(1)', '끊임없는 환영': '00163', '전장의 선봉장': '00150(2)',
                      '검은 성전의 기억': 'h13', '원초의 꿈(5개조)': '00171(1)', '통곡의 수문장': '00146',
                      '사암주극': '00132', '검은 성전의 기억': 'h7', '원초의 꿈(5개조)': '00157(2)',
                      '일렉트로전': '00138', '천장군 : 전승의 빛': '00129', '검은 성전의 기억': 'h5',
                      '원초의 꿈(5개조)': '00146(1)', '사일런트 베놈': '00129(1)', '기가 드릴러': '00138(1)',
                      '검은 성전의 기억': 'h4', '원초의 꿈(5개조)': '00145(1)', '금강비장도': '00141', '야천도': '00128',
                      '검은 성전의 기억': 'h6', '원초의 꿈(5개조)': '00150(3)', '차갑게 굳어버린 홍염': '00134',
                      '다크 플레임 리퍼': '00124', '검은 성전의 기억': 'h2', '원초의 꿈(5개조)': '00142',
                      '아토믹 파일': '00121', '홍염폭검': '00136', '검은 성전의 기억': 'h3', '원초의 꿈(5개조)': '00146(2)',
                      '베투스 코르': '00119', '프로젝트 : 오버코어': '00128(1)', '검은 성전의 기억': 'h1',
                      '원초의 꿈(5개조)': '00135'}
