wep_list = {
    '귀검/나이트': {
        '광검': [
            '별의 바다 : 바드나후',
            '적광검 루이너스',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '소검': [
            '전장의 열정 : 앵거바딜',
            '신념의 징표 : 칼리번',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '둔기': [
            '판데모니엄 플레임',
            '하티 - 달을 탐하는 자',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '도': [
            '태극천제검(음)',
            '태극천제검(양)',
            '아방가르드',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '대검': [
            '데우스 이미저리',
            '카심의 대검',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ]
    },
    '격투가': {
        '너클': [
            '백호의 울음소리',
            '청명한 의지',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '통파': [
            '청사곤',
            '어그레시브 카이트',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '클로': [
            '매드 싸이클론',
            '로드 오브 더 페인',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '건틀릿': [
            '태음신 : 영귀',
            '디스트로이 프레셔',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '권투글러브': [
            '블레이즈 헌터',
            '일렉트로 부스터',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ]
    },
    '거너': {
        '자동권총': [
            '팔로우 더 스타티스',
            '메가쇼크 런처',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '보우건': [
            '커스텀 라이져 보우',
            '음유시인의 만돌린',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '리볼버': [
            '미드나잇 러시안 룰렛',
            '블러드 샷 부스터',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '머스켓': [
            '터뷸런스',
            '스트라이커-X',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '핸드캐넌': [
            '레볼루션 차지',
            '오버스펙 라이즈',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ]
    },
    '마법사': {
        '스태프': [
            '세계수의 뿌리',
            '루나 베네딕티오',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '로드': [
            '플레임 헬',
            '마력의 샘 : 카스탈리아',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '봉': [
            '우디 부기',
            '카오스 시드',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '창': [
            '어나이얼레이터',
            '영창 : 불멸의 혼',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '빗자루': [
            '세계수의 요정',
            '순백의 기도',
            '검은 성전의 기억',
            '원초의 꿈(딜5개조/벞3개조)'
        ]
    },
    '프리스트': {
        '십자가': [
            '포 더 세크리드',
            '눈부신 영광',
            '검은 성전의 기억',
            '원초의 꿈(딜5개조/벞3개조)'
        ],
        '염주': [
            '윤회의 고리 : 환룡',
            '고대 신수의 기억',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '토템': [
            '라스트 인파이팅',
            '개척자의 길',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '배틀액스': [
            '불카누스의 두번째 흔적',
            '신념의 무게',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '낫': [
            '루즈 리즌',
            '이교도 교주의 심판',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ]
    },
    '도적': {
        '단검': [
            '샤프 쉐도어',
            '암살단장의 옥장도',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '쌍검': [
            '화려한 눈속임',
            '핏빛 무도회',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '완드': [
            '푸른 생명의 이면',
            '고결한 정령의 유물',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '차크라웨펀': [
            '블러드 루비아이',
            '도화선',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ]
    },
    '마창사': {
        '장창': [
            '끊임없는 환영',
            '전장의 선봉장',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '미늘창': [
            '통곡의 수문장',
            '사암주극',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '광창': [
            '일렉트로전',
            '천장군 : 전승의 빛',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '투창': [
            '사일런트 베놈',
            '기가 드릴러',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ]
    },
    '총검사': {
        '장도': [
            '금강비장도',
            '야천도',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '소태도': [
            '차갑게 굳어버린 홍염',
            '다크 플레임 리퍼',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '중검': [
            '아토믹 파일',
            '홍염폭검',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ],
        '코어블레이드': [
            '베투스 코르',
            '프로젝트 : 오버코어',
            '검은 성전의 기억',
            '원초의 꿈(5개조)', '원초의 꿈(6개조)', '원초의 꿈(7개조)'
        ]
    }
}

wep_image_filename = {'111001n': '검은 성전의 기억', '111002n': '별의 바다 : 바드나후', '111003n': '적광검 루이너스',
                      '111004n': '전장의 열정 : 앵거바딜', '111005n': '신념의 징표 : 칼리번', '111006n': '판데모니엄 플레임',
                      '111007n': '하티 - 달을 탐하는 자', '111008n': '태극천제검', '111009n': '아방가르드', '111010n': '데우스 이미저리',
                      '111011n': '카심의 대검', '111012n': '백호의 울음소리', '111013n': '청명한 의지', '111014n': '청사곤',
                      '111015n': '어그레시브 카이트', '111016n': '매드 싸이클론', '111017n': '로드 오브 더 페인', '111018n': '태음신 : 영귀',
                      '111019n': '디스트로이 프레셔', '111020n': '블레이즈 헌터', '111021n': '일렉트로 부스터', '111022n': '팔로우 더 스타티스',
                      '111023n': '메가쇼크 런처', '111024n': '커스텀 라이져 보우', '111025n': '음유시인의 만돌린', '111026n': '미드나잇 러시안 룰렛',
                      '111027n': '블러드 샷 부스터', '111028n': '터뷸런스', '111029n': '스트라이커-X', '111030n': '레볼루션 차지',
                      '111031n': '오버스펙 라이즈', '111032n': '세계수의 뿌리', '111033n': '루나 베네딕티오', '111034n': '플레임 헬',
                      '111035n': '마력의 샘 : 카스탈리아', '111036n': '우디 부기', '111037n': '카오스 시드', '111038n': '어나이얼레이터',
                      '111039n': '영창 : 불멸의 혼', '111040n': '세계수의 요정', '111041n': '순백의 기도', '111042n': '포 더 세크리드',
                      '111043n': '눈부신 영광', '111044n': '윤회의 고리 : 환룡', '111045n': '고대 신수의 기억', '111046n': '라스트 인파이팅',
                      '111047n': '개척자의 길', '111048n': '불카누스의 두번째 흔적', '111049n': '신념의 무게', '111050n': '루즈 리즌',
                      '111051n': '이교도 교주의 심판', '111052n': '샤프 쉐도어', '111053n': '암살단장의 옥장도', '111054n': '화려한 눈속임',
                      '111055n': '핏빛 무도회', '111056n': '푸른 생명의 이면', '111057n': '고결한 정령의 유물', '111058n': '블러드 루비아이',
                      '111059n': '도화선', '111060n': '끊임없는 환영', '111061n': '전장의 선봉장', '111062n': '통곡의 수문장',
                      '111063n': '사암주극', '111064n': '일렉트로전', '111065n': '천장군 : 전승의 빛', '111066n': '사일런트 베놈',
                      '111067n': '기가 드릴러', '111068n': '금강비장도', '111069n': '야천도', '111070n': '차갑게 굳어버린 홍염',
                      '111071n': '다크 플레임 리퍼', '111072n': '아토믹 파일', '111073n': '홍염폭검', '111074n': '베투스 코르',
                      '111075n': '프로젝트 : 오버코어', '111076n': '원초의 꿈(5개조)', '111077n': '원초의 꿈(6개조)',
                      '111078n': '원초의 꿈(7개조)', '111108n': '태극천제검'}

wep_filename_image = {'검은 성전의 기억': '111001n', '별의 바다 : 바드나후': '111002n', '적광검 루이너스': '111003n',
                      '전장의 열정 : 앵거바딜': '111004n', '신념의 징표 : 칼리번': '111005n', '판데모니엄 플레임': '111006n',
                      '하티 - 달을 탐하는 자': '111007n', '태극천제검': '111108n', '아방가르드': '111009n', '데우스 이미저리': '111010n',
                      '카심의 대검': '111011n', '백호의 울음소리': '111012n', '청명한 의지': '111013n', '청사곤': '111014n',
                      '어그레시브 카이트': '111015n', '매드 싸이클론': '111016n', '로드 오브 더 페인': '111017n', '태음신 : 영귀': '111018n',
                      '디스트로이 프레셔': '111019n', '블레이즈 헌터': '111020n', '일렉트로 부스터': '111021n', '팔로우 더 스타티스': '111022n',
                      '메가쇼크 런처': '111023n', '커스텀 라이져 보우': '111024n', '음유시인의 만돌린': '111025n', '미드나잇 러시안 룰렛': '111026n',
                      '블러드 샷 부스터': '111027n', '터뷸런스': '111028n', '스트라이커-X': '111029n', '레볼루션 차지': '111030n',
                      '오버스펙 라이즈': '111031n', '세계수의 뿌리': '111032n', '루나 베네딕티오': '111033n', '플레임 헬': '111034n',
                      '마력의 샘 : 카스탈리아': '111035n', '우디 부기': '111036n', '카오스 시드': '111037n', '어나이얼레이터': '111038n',
                      '영창 : 불멸의 혼': '111039n', '세계수의 요정': '111040n', '순백의 기도': '111041n', '포 더 세크리드': '111042n',
                      '눈부신 영광': '111043n', '윤회의 고리 : 환룡': '111044n', '고대 신수의 기억': '111045n', '라스트 인파이팅': '111046n',
                      '개척자의 길': '111047n', '불카누스의 두번째 흔적': '111048n', '신념의 무게': '111049n', '루즈 리즌': '111050n',
                      '이교도 교주의 심판': '111051n', '샤프 쉐도어': '111052n', '암살단장의 옥장도': '111053n', '화려한 눈속임': '111054n',
                      '핏빛 무도회': '111055n', '푸른 생명의 이면': '111056n', '고결한 정령의 유물': '111057n', '블러드 루비아이': '111058n',
                      '도화선': '111059n', '끊임없는 환영': '111060n', '전장의 선봉장': '111061n', '통곡의 수문장': '111062n',
                      '사암주극': '111063n', '일렉트로전': '111064n', '천장군 : 전승의 빛': '111065n', '사일런트 베놈': '111066n',
                      '기가 드릴러': '111067n', '금강비장도': '111068n', '야천도': '111069n', '차갑게 굳어버린 홍염': '111070n',
                      '다크 플레임 리퍼': '111071n', '아토믹 파일': '111072n', '홍염폭검': '111073n', '베투스 코르': '111074n',
                      '프로젝트 : 오버코어': '111075n', '원초의 꿈(5개조)': '111076n', '원초의 꿈(6개조)': '111077n',
                      '원초의 꿈(7개조)': '111078n'}
